dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Timer.c
#include "RL78G13_Timer.h"

/*定时器时钟选择单元寄存器*/

/**
 * Function:        static void RL78G13_Timer_TPS_Write(uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tps write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TPS_Write(uint16_t value)
{
    TPS0 = value;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TPS_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tps read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TPS_Read(void)
{
    uint16_t regValue = TPS0;
    return regValue;
}

/*定时器模式寄存器*/

/**
 * Function:        static void RL78G13_Timer_TMR_Write(RL78G13_TIMER_CHANNEL channel, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer timer write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel -   The channel.
 *  value -     The value.
 */

static void RL78G13_Timer_TMR_Write(RL78G13_TIMER_CHANNEL channel, uint16_t value)
{
    switch (channel)
    {
    case RL78G13_TIMER_CHANNEL_0:
        TMR00 = value;
        break;
    case RL78G13_TIMER_CHANNEL_1:
        TMR01 = value;
        break;
    case RL78G13_TIMER_CHANNEL_2:
        TMR02 = value;
        break;
    case RL78G13_TIMER_CHANNEL_3:
        TMR03 = value;
        break;
    case RL78G13_TIMER_CHANNEL_4:
        TMR04 = value;
        break;
    case RL78G13_TIMER_CHANNEL_5:
        TMR05 = value;
        break;
    case RL78G13_TIMER_CHANNEL_6:
        TMR06 = value;
        break;
    case RL78G13_TIMER_CHANNEL_7:
        TMR07 = value;
        break;
    }
}

/**
 * Function:        static uint16_t RL78G13_Timer_TMR_Read(RL78G13_TIMER_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 timer timer read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TMR_Read(RL78G13_TIMER_CHANNEL channel)
{
    uint16_t regValue = 0;
    switch (channel)
    {
    case RL78G13_TIMER_CHANNEL_0:
        regValue = TMR00;
        break;
    case RL78G13_TIMER_CHANNEL_1:
        regValue = TMR01;
        break;
    case RL78G13_TIMER_CHANNEL_2:
        regValue = TMR02;
        break;
    case RL78G13_TIMER_CHANNEL_3:
        regValue = TMR03;
        break;
    case RL78G13_TIMER_CHANNEL_4:
        regValue = TMR04;
        break;
    case RL78G13_TIMER_CHANNEL_5:
        regValue = TMR05;
        break;
    case RL78G13_TIMER_CHANNEL_6:
        regValue = TMR06;
        break;
    case RL78G13_TIMER_CHANNEL_7:
        regValue = TMR07;
        break;
    }
    return regValue;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TSR_Read(RL78G13_TIMER_CHANNEL channel)
 *
 * Brief:
 *      Rl 78 g 13 timer tsr read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel -   The channel.
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TSR_Read(RL78G13_TIMER_CHANNEL channel)
{
    uint16_t regValue = 0;
    switch (channel)
    {
    case RL78G13_TIMER_CHANNEL_0:
        regValue = TSR00;
        break;
    case RL78G13_TIMER_CHANNEL_1:
        regValue = TSR01;
        break;
    case RL78G13_TIMER_CHANNEL_2:
        regValue = TSR02;
        break;
    case RL78G13_TIMER_CHANNEL_3:
        regValue = TSR03;
        break;
    case RL78G13_TIMER_CHANNEL_4:
        regValue = TSR04;
        break;
    case RL78G13_TIMER_CHANNEL_5:
        regValue = TSR05;
        break;
    case RL78G13_TIMER_CHANNEL_6:
        regValue = TSR06;
        break;
    case RL78G13_TIMER_CHANNEL_7:
        regValue = TSR07;
        break;
    }
    return regValue;
}

/*定时器通道允许状态寄存器,只读*/

/**
 * Function:        static uint16_t RL78G13_Timer_TE_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer te read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TE_Read(void)
{
    uint16_t regValue = 0;
    regValue = TE0;
    return regValue;
}

/*定时器通道开始寄存器*/

/**
 * Function:        static void RL78G13_Timer_TS_Write(uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer ts write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TS_Write(uint16_t value)
{
    TS0 = value;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TS_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer ts read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TS_Read(void)
{
    uint16_t regValue = TS0;
    return regValue;
}

/*定时器通道停止寄存器*/

/**
 * Function:        static void RL78G13_Timer_TT_Write(uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tt write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TT_Write(uint16_t value)
{
    TT0 = value;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TT_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tt read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TT_Read(void)
{
    uint16_t regValue = TT0;
    return regValue;
}

/*定时器输入选择寄存器,八位*/

/**
 * Function:        static void RL78G13_Timer_TIS_Write(uint8_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tis write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TIS_Write(uint8_t value)
{
    TIS0 = value;
}

/**
 * Function:        static uint8_t RL78G13_Timer_TIS_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tis read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint8_t.
 */

static uint8_t RL78G13_Timer_TIS_Read(void)
{
    uint8_t regValue = TIS0;
    return regValue;
}

/*定时器输出允许寄存器*/

/**
 * Function:        static void RL78G13_Timer_TOE_Write(uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer toe write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TOE_Write(uint16_t value)
{
    TOE0 = value;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TOE_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer toe read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

