dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Timer.c
static uint16_t RL78G13_Timer_TOE_Read(void)
{
    uint16_t regValue = TOE0;
    return regValue;
}

/*定时器输出寄存器*/

/**
 * Function:        static void RL78G13_Timer_TO_Write(uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer to write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TO_Write(uint16_t value)
{
    TO0 = value;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TO_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer to read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TO_Read(void)
{
    uint16_t regValue = TO0;
    return regValue;
}

/*定时器输出电平寄存器*/

/**
 * Function:        static void RL78G13_Timer_TOL_Write(uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tolerance write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TOL_Write(uint16_t value)
{
    TOL0 = value;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TOL_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tolerance read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TOL_Read(void)
{
    uint16_t regValue = TOL0;
    return regValue;
}

/*定时器输出模式寄存器*/

/**
 * Function:        static void RL78G13_Timer_TOM_Write(uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tom write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_TOM_Write(uint16_t value)
{
    TOM0 = value;
}

/**
 * Function:        static uint16_t RL78G13_Timer_TOM_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tom read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

static uint16_t RL78G13_Timer_TOM_Read(void)
{
    uint16_t regValue = TOM0;
    return regValue;
}

/*噪声滤波器允许寄存器*/

/**
 * Function:        static void RL78G13_Timer_NFEN1_Write(uint8_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer nfen 1 write.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  value -     The value.
 */

static void RL78G13_Timer_NFEN1_Write(uint8_t value)
{
    NFEN1 = value;
}

/**
 * Function:        static uint8_t RL78G13_Timer_NFEN1_Read(void)
 *
 * Brief:
 *      Rl 78 g 13 timer nfen 1 read.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint8_t.
 */

static uint8_t RL78G13_Timer_NFEN1_Read(void)
{
    uint8_t regValue = NFEN1;
    return regValue;
}



/*定时器时钟选择单元寄存器*/

/**
 * Function:    
 *  void RL78G13_Timer_TPS_Write_All(uint16_t flck0, uint16_t flck1, uint16_t flck2,
 *  uint16_t flck3)
 *
 * Brief:
 *      Rl 78 g 13 timer tps write all.
 *      选择定时器每个单元输出的时钟的分频系数
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  flck0 -     The flck 0.
 *  flck1 -     The first flck.
 *  flck2 -     The second flck.
 *  flck3 -     The third flck.
 */

void RL78G13_Timer_TPS_Write_All(uint16_t flck0, uint16_t flck1, 
    uint16_t flck2, uint16_t flck3)
{
    uint16_t regValue = 0;
    flck0 &= RL78G13_TIMER_TPS_CLK00_DIV_MASK;
    flck1 &= RL78G13_TIMER_TPS_CLK01_DIV_MASK;
    flck2 &= RL78G13_TIMER_TPS_CLK02_DIV_MASK;
    flck3 &= RL78G13_TIMER_TPS_CLK03_DIV_MASK;
    regValue = (flck0| flck1| flck2| flck3);
    RL78G13_Timer_TPS_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_TPS_Write_One(uint16_t mask,uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tps write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_TPS_Write_One(uint16_t mask,uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TPS_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TPS_Write(regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TPS_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tps read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TPS_ReadAll(void)
{
    return RL78G13_Timer_TPS_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TPS_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer tps read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TPS_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TPS_Read();
    regValue &= mask;
    return regValue;
}


/*TMR*/

/**
 * Function:    
 *  void RL78G13_Timer_TMR_Write_All(RL78G13_TIMER_CHANNEL ch,uint16_t clkSelect,
 *  uint16_t tclkSelect,uint16_t masterSplitSelect,uint16_t trigStartMode, uint16_t edgeSelect,
 *  uint16_t channelModeSelect,uint16_t startIntSet)
 *
 * Brief:
 *      Rl 78 g 13 timer timer write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  ch -                    The ch.
 *  clkSelect -             The clock select.
 *  tclkSelect -            The tclk select.
 *  masterSplitSelect -     The master split select.
 *  trigStartMode -         The trig start mode.
 *  edgeSelect -            The edge select.
 *  channelModeSelect -     The channel mode select.
 *  startIntSet -           The start int set.
 */

void RL78G13_Timer_TMR_Write_All(RL78G13_TIMER_CHANNEL ch,uint16_t clkSelect,
     uint16_t tclkSelect,uint16_t masterSplitSelect,uint16_t trigStartMode,
     uint16_t edgeSelect,uint16_t channelModeSelect,uint16_t startIntSet)
{
     uint16_t regValue = 0;
     clkSelect &= RL78G13_TIMER_TMR_CLOCK_SELECT_MASK;
     tclkSelect &= RL78G13_TIMER_TMR_CCS_FTCLK_SELECT_MASK;
     masterSplitSelect &= RL78G13_TIMER_TMR_MASTER_SELECT_MASK;
     trigStartMode &= RL78G13_TIMER_TMR_STS_TRIG_SRC_SELECT_MASK;
     edgeSelect &= RL78G13_TIMER_TMR_CIS_TRIG_EDGE_SELECT_MASK;
     channelModeSelect &= RL78G13_TIMER_TMR_CHANNEL_MODE_SELECT_MASK;
     startIntSet &= RL78G13_TIMER_TMR_START_INT_ENABLE_MASK;
     regValue = (clkSelect| tclkSelect| masterSplitSelect| trigStartMode|
         edgeSelect| channelModeSelect| startIntSet);
     RL78G13_Timer_TMR_Write(ch, regValue);
}

/**
 * Function:    
 *  void RL78G13_Timer_TMR_Write_One(RL78G13_TIMER_CHANNEL ch, uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer timer write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  ch -        The ch.
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_TMR_Write_One(RL78G13_TIMER_CHANNEL ch,
    uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TMR_Read(ch);
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TMR_Write(ch,regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TMR_ReadAll(RL78G13_TIMER_CHANNEL ch)
 *
 * Brief:
 *      Rl 78 g 13 timer timer read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  ch -    The ch.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TMR_ReadAll(RL78G13_TIMER_CHANNEL ch)
{
    return RL78G13_Timer_TMR_Read(ch);
}

/**
 * Function:        uint16_t RL78G13_Timer_TMR_ReadOne(RL78G13_TIMER_CHANNEL ch, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer timer read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  ch -    The ch.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TMR_ReadOne(RL78G13_TIMER_CHANNEL ch,
     uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TMR_Read(ch);
    regValue &= mask;
    return regValue;
}

/*TSR*/

/**
 * Function:        uint16_t RL78G13_Timer_TSR_ReadAll(RL78G13_TIMER_CHANNEL ch)
 *
 * Brief:
 *      Rl 78 g 13 timer tsr read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  ch -    The ch.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TSR_ReadAll(RL78G13_TIMER_CHANNEL ch)
{
    return RL78G13_Timer_TSR_Read(ch);
}

/**
 * Function:        uint16_t RL78G13_Timer_TSR_ReadOne(RL78G13_TIMER_CHANNEL ch, uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer tsr read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  ch -    The ch.
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

