dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Timer.c
uint16_t RL78G13_Timer_TSR_ReadOne(RL78G13_TIMER_CHANNEL ch,
     uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TSR_Read(ch);
    regValue &= mask;
    return regValue;
}

/*TE*/

/**
 * Function:        uint16_t RL78G13_Timer_TE_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer te read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TE_ReadAll(void)
{
    return RL78G13_Timer_TE_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TE_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer te read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TE_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TE_Read();
    regValue &= mask;
    return regValue;
}


/*TS*/

/**
 * Function:    
 *  void RL78G13_Timer_TS_Write_All(uint16_t channel0Start, uint16_t channel1Start,
 *  uint16_t channel2Start, uint16_t channel3Start, uint16_t channel4Start,
 *  uint16_t channel5Start, uint16_t channel6Start, uint16_t channel7Start,
 *  uint16_t channelh1Start, uint16_t channelh3Start)
 *
 * Brief:
 *      Rl 78 g 13 timer ts write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel0Start -     The channel 0 start.
 *  channel1Start -     The channel 1 start.
 *  channel2Start -     The channel 2 start.
 *  channel3Start -     The channel 3 start.
 *  channel4Start -     The channel 4 start.
 *  channel5Start -     The channel 5 start.
 *  channel6Start -     The channel 6 start.
 *  channel7Start -     The channel 7 start.
 *  channelh1Start -    The channelh 1 start.
 *  channelh3Start -    The channelh 3 start.
 */

void RL78G13_Timer_TS_Write_All(uint16_t channel0Start, uint16_t channel1Start, 
     uint16_t channel2Start, uint16_t channel3Start, uint16_t channel4Start, 
     uint16_t channel5Start, uint16_t channel6Start, uint16_t channel7Start, 
     uint16_t channelh1Start, uint16_t channelh3Start)
{
     uint16_t regValue = 0;
     channel0Start &= RL78G13_TIMER_TS_CHANNEL0_START_ON_MASK;
     channel1Start &= RL78G13_TIMER_TS_CHANNEL1_START_ON_MASK;
     channel2Start &= RL78G13_TIMER_TS_CHANNEL2_START_ON_MASK;
     channel3Start &= RL78G13_TIMER_TS_CHANNEL3_START_ON_MASK;
     channel4Start &= RL78G13_TIMER_TS_CHANNEL4_START_ON_MASK;
     channel5Start &= RL78G13_TIMER_TS_CHANNEL5_START_ON_MASK;
     channel6Start &= RL78G13_TIMER_TS_CHANNEL6_START_ON_MASK;
     channel7Start &= RL78G13_TIMER_TS_CHANNEL7_START_ON_MASK;
     channelh1Start &= RL78G13_TIMER_TS_CHANNEL_H1_START_ON_MASK;
     channelh3Start &= RL78G13_TIMER_TS_CHANNEL_H3_START_ON_MASK;
     regValue = (channel0Start | channel1Start | channel2Start |
         channel3Start | channel4Start | channel5Start | channel6Start |
         channel7Start | channelh1Start | channelh3Start);
     RL78G13_Timer_TS_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_TS_Write_One(uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer ts write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_TS_Write_One(uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TS_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TS_Write(regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TS_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer ts read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TS_ReadAll(void)
{
    return RL78G13_Timer_TS_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TS_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer ts read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TS_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TS_Read();
    regValue &= mask;
    return regValue;
}


/*TT*/

/**
 * Function:    
 *  void RL78G13_Timer_TT_Write_All(uint16_t channel0Stop, uint16_t channel1Stop,
 *  uint16_t channel2Stop, uint16_t channel3Stop, uint16_t channel4Stop, uint16_t channel5Stop,
 *  uint16_t channel6Stop, uint16_t channel7Stop, uint16_t channelh1Stop, uint16_t channelh3Stop)
 *
 * Brief:
 *      Rl 78 g 13 timer tt write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel0Stop -      The channel 0 stop.
 *  channel1Stop -      The channel 1 stop.
 *  channel2Stop -      The channel 2 stop.
 *  channel3Stop -      The channel 3 stop.
 *  channel4Stop -      The channel 4 stop.
 *  channel5Stop -      The channel 5 stop.
 *  channel6Stop -      The channel 6 stop.
 *  channel7Stop -      The channel 7 stop.
 *  channelh1Stop -     The channelh 1 stop.
 *  channelh3Stop -     The channelh 3 stop.
 */

void RL78G13_Timer_TT_Write_All(uint16_t channel0Stop, uint16_t channel1Stop, 
     uint16_t channel2Stop, uint16_t channel3Stop, uint16_t channel4Stop, 
     uint16_t channel5Stop, uint16_t channel6Stop, uint16_t channel7Stop, 
     uint16_t channelh1Stop, uint16_t channelh3Stop)
{
     uint16_t regValue = 0;
     channel0Stop &= RL78G13_TIMER_TT_CHANNEL0_STOP_ON_MASK;
     channel1Stop &= RL78G13_TIMER_TT_CHANNEL1_STOP_ON_MASK;
     channel2Stop &= RL78G13_TIMER_TT_CHANNEL2_STOP_ON_MASK;
     channel3Stop &= RL78G13_TIMER_TT_CHANNEL3_STOP_ON_MASK;
     channel4Stop &= RL78G13_TIMER_TT_CHANNEL4_STOP_ON_MASK;
     channel5Stop &= RL78G13_TIMER_TT_CHANNEL5_STOP_ON_MASK;
     channel6Stop &= RL78G13_TIMER_TT_CHANNEL6_STOP_ON_MASK;
     channel7Stop &= RL78G13_TIMER_TT_CHANNEL7_STOP_ON_MASK;
     channelh1Stop &= RL78G13_TIMER_TT_CHANNEL_H1_STOP_ON_MASK;
     channelh3Stop &= RL78G13_TIMER_TT_CHANNEL_H3_STOP_ON_MASK;
     regValue = (channel0Stop| channel1Stop| channel2Stop | channel3Stop |
         channel4Stop | channel5Stop | channel6Stop | channel7Stop |
         channelh1Stop | channelh3Stop);
     RL78G13_Timer_TT_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_TT_Write_One(uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tt write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_TT_Write_One(uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TT_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TT_Write(regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TT_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tt read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TT_ReadAll(void)
{
    return RL78G13_Timer_TT_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TT_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer tt read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TT_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TT_Read();
    regValue &= mask;
    return regValue;
}

/*TIS*/

/**
 * Function:        void RL78G13_Timer_TIS_Write_All(uint8_t ch5InputSelect)
 *
 * Brief:
 *      Rl 78 g 13 timer tis write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  ch5InputSelect -    The 5 input select.
 */

void RL78G13_Timer_TIS_Write_All(uint8_t ch5InputSelect)
{
     uint8_t regValue = 0;
     ch5InputSelect &= RL78G13_TIMER_TIS_CHANNEL5_INPUT_PIN_SELECT_MASK;
     regValue = ch5InputSelect;
     RL78G13_Timer_TIS_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_TIS_Write_One(uint8_t mask, uint8_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tis write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_TIS_Write_One(uint8_t mask, uint8_t value)
{
    uint8_t regValue = RL78G13_Timer_TIS_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TIS_Write(regValue);
}

/**
 * Function:        uint8_t RL78G13_Timer_TIS_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tis read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint8_t.
 */

