dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Timer.c
uint8_t RL78G13_Timer_TIS_ReadAll(void)
{
    return RL78G13_Timer_TIS_Read();
}

 /**
  * Function:       uint8_t RL78G13_Timer_TIS_ReadOne(uint8_t mask)
  *
  * Brief:
  *         Rl 78 g 13 timer tis read one.
  *
  * Author:
  *         Dink
  *
  * Date:
  *         2017/10/30
  *
  * Param:
  *     mask -  The mask.
  *
  * Returns:
  *         An uint8_t.
  */

 uint8_t RL78G13_Timer_TIS_ReadOne(uint8_t mask)
{
    uint8_t regValue = RL78G13_Timer_TIS_Read();
    regValue &= mask;
    return regValue;
}

/*TOE*/

/**
 * Function:    
 *  void RL78G13_Timer_TOE_Write_All(uint16_t channel0OutputEnable, uint16_t channel1OutputEnable,
 *  uint16_t channel2OutputEnable, uint16_t channel3OutputEnable, uint16_t channel4OutputEnable,
 *  uint16_t channel5OutputEnable, uint16_t channel6OutputEnable, uint16_t channel7OutputEnable)
 *
 * Brief:
 *      Rl 78 g 13 timer toe write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel0OutputEnable -  The channel 0 output enable.
 *  channel1OutputEnable -  The channel 1 output enable.
 *  channel2OutputEnable -  The channel 2 output enable.
 *  channel3OutputEnable -  The channel 3 output enable.
 *  channel4OutputEnable -  The channel 4 output enable.
 *  channel5OutputEnable -  The channel 5 output enable.
 *  channel6OutputEnable -  The channel 6 output enable.
 *  channel7OutputEnable -  The channel 7 output enable.
 */

void RL78G13_Timer_TOE_Write_All(uint16_t channel0OutputEnable, uint16_t channel1OutputEnable, 
     uint16_t channel2OutputEnable, uint16_t channel3OutputEnable, uint16_t channel4OutputEnable, 
     uint16_t channel5OutputEnable, uint16_t channel6OutputEnable, uint16_t channel7OutputEnable)
{
     uint16_t regValue = 0;
     channel0OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_0_OUTPUT_SET_MASK;
     channel1OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_1_OUTPUT_SET_MASK;
     channel2OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_2_OUTPUT_SET_MASK;
     channel3OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_3_OUTPUT_SET_MASK;
     channel4OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_4_OUTPUT_SET_MASK;
     channel5OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_5_OUTPUT_SET_MASK;
     channel6OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_6_OUTPUT_SET_MASK;
     channel7OutputEnable &= RL78G13_TIMER_TOE_CHANNEL_7_OUTPUT_SET_MASK;
     regValue = (channel0OutputEnable| channel1OutputEnable| channel2OutputEnable|
         channel3OutputEnable| channel4OutputEnable| channel5OutputEnable| channel6OutputEnable|
         channel7OutputEnable);
     RL78G13_Timer_TOE_Write(regValue);
}

 /**
  * Function:       void RL78G13_Timer_TOE_Write_One(uint16_t mask, uint16_t value)
  *
  * Brief:
  *         Rl 78 g 13 timer toe write one.
  *
  * Author:
  *         Dink
  *
  * Date:
  *         2017/10/30
  *
  * Param:
  *     mask -      The mask.
  *     value -     The value.
  */

 void RL78G13_Timer_TOE_Write_One(uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TOE_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TOE_Write(regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TOE_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer toe read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TOE_ReadAll(void)
{
    return RL78G13_Timer_TOE_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TOE_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer toe read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TOE_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TOE_Read();
    regValue &= mask;
    return regValue;
}

/*TO*/

/**
 * Function:    
 *  void RL78G13_Timer_TO_Write_All(uint16_t channel0OutputValue, uint16_t channel1OutputValue,
 *  uint16_t channel2OutputValue, uint16_t channel3OutputValue, uint16_t channel4OutputValue,
 *  uint16_t channel5OutputValue, uint16_t channel6OutputValue, uint16_t channel7OutputValue)
 *
 * Brief:
 *      Rl 78 g 13 timer to write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel0OutputValue -   The channel 0 output value.
 *  channel1OutputValue -   The channel 1 output value.
 *  channel2OutputValue -   The channel 2 output value.
 *  channel3OutputValue -   The channel 3 output value.
 *  channel4OutputValue -   The channel 4 output value.
 *  channel5OutputValue -   The channel 5 output value.
 *  channel6OutputValue -   The channel 6 output value.
 *  channel7OutputValue -   The channel 7 output value.
 */

void RL78G13_Timer_TO_Write_All(uint16_t channel0OutputValue, uint16_t channel1OutputValue, 
     uint16_t channel2OutputValue, uint16_t channel3OutputValue, uint16_t channel4OutputValue, 
     uint16_t channel5OutputValue, uint16_t channel6OutputValue, uint16_t channel7OutputValue)
{
     uint16_t regValue = 0;
     channel0OutputValue &= RL78G13_TIMER_TO_CHANNEL_0_OUTPUT_VALUE_MASK;
     channel1OutputValue &= RL78G13_TIMER_TO_CHANNEL_1_OUTPUT_VALUE_MASK;
     channel2OutputValue &= RL78G13_TIMER_TO_CHANNEL_2_OUTPUT_VALUE_MASK;
     channel3OutputValue &= RL78G13_TIMER_TO_CHANNEL_3_OUTPUT_VALUE_MASK;
     channel4OutputValue &= RL78G13_TIMER_TO_CHANNEL_4_OUTPUT_VALUE_MASK;
     channel5OutputValue &= RL78G13_TIMER_TO_CHANNEL_5_OUTPUT_VALUE_MASK;
     channel6OutputValue &= RL78G13_TIMER_TO_CHANNEL_6_OUTPUT_VALUE_MASK;
     channel7OutputValue &= RL78G13_TIMER_TO_CHANNEL_7_OUTPUT_VALUE_MASK;
     regValue = (channel0OutputValue| channel1OutputValue| channel2OutputValue|
         channel3OutputValue| channel4OutputValue| channel5OutputValue|
         channel6OutputValue| channel7OutputValue);
     RL78G13_Timer_TO_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_TO_Write_One(uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer to write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

