dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Timer.c
void RL78G13_Timer_TO_Write_One(uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TO_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TO_Write(regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TO_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer to read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TO_ReadAll(void)
{
    return RL78G13_Timer_TO_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TO_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer to read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TO_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TO_Read();
    regValue &= mask;
    return regValue;
}

/*TOL*/

/**
 * Function:    
 *  void RL78G13_Timer_TOL_Write_All(uint16_t channel1Resever, uint16_t channel2Resever,
 *  uint16_t channel3Resever, uint16_t channel4Resever, uint16_t channel5Resever,
 *  uint16_t channel6Resever, uint16_t channel7Resever)
 *
 * Brief:
 *      Rl 78 g 13 timer tolerance write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel1Resever -   The channel 1 resever.
 *  channel2Resever -   The channel 2 resever.
 *  channel3Resever -   The channel 3 resever.
 *  channel4Resever -   The channel 4 resever.
 *  channel5Resever -   The channel 5 resever.
 *  channel6Resever -   The channel 6 resever.
 *  channel7Resever -   The channel 7 resever.
 */

void RL78G13_Timer_TOL_Write_All(uint16_t channel1Resever, uint16_t channel2Resever, 
     uint16_t channel3Resever, uint16_t channel4Resever, uint16_t channel5Resever, 
     uint16_t channel6Resever, uint16_t channel7Resever)
{
     uint16_t regValue = 0;
     channel1Resever &= RL78G13_TIMER_TOL_CHANNEL_1_OUTPUT_REVESER_MASK;
     channel2Resever &= RL78G13_TIMER_TOL_CHANNEL_2_OUTPUT_REVESER_MASK;
     channel3Resever &= RL78G13_TIMER_TOL_CHANNEL_3_OUTPUT_REVESER_MASK;
     channel4Resever &= RL78G13_TIMER_TOL_CHANNEL_4_OUTPUT_REVESER_MASK;
     channel5Resever &= RL78G13_TIMER_TOL_CHANNEL_5_OUTPUT_REVESER_MASK;
     channel6Resever &= RL78G13_TIMER_TOL_CHANNEL_6_OUTPUT_REVESER_MASK;
     channel7Resever &= RL78G13_TIMER_TOL_CHANNEL_7_OUTPUT_REVESER_MASK;
     regValue = (channel1Resever| channel2Resever| channel3Resever
         | channel4Resever| channel5Resever| channel6Resever| channel7Resever);
     RL78G13_Timer_TOL_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_TOL_Write_One(uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tolerance write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_TOL_Write_One(uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TOL_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TOL_Write(regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TOL_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tolerance read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TOL_ReadAll(void)
{
    return RL78G13_Timer_TOL_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TOL_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer tolerance read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TOL_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TOL_Read();
    regValue &= mask;
    return regValue;
}

/*TOM*/

/**
 * Function:    
 *  void RL78G13_Timer_TOM_Write_All(uint16_t channel1OutPutMode, uint16_t channel2OutPutMode,
 *  uint16_t channel3OutPutMode, uint16_t channel4OutPutMode, uint16_t channel5OutPutMode,
 *  uint16_t channel6OutPutMode, uint16_t channel7OutPutMode)
 *
 * Brief:
 *      Rl 78 g 13 timer tom write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel1OutPutMode -    The channel 1 out put mode.
 *  channel2OutPutMode -    The channel 2 out put mode.
 *  channel3OutPutMode -    The channel 3 out put mode.
 *  channel4OutPutMode -    The channel 4 out put mode.
 *  channel5OutPutMode -    The channel 5 out put mode.
 *  channel6OutPutMode -    The channel 6 out put mode.
 *  channel7OutPutMode -    The channel 7 out put mode.
 */

void RL78G13_Timer_TOM_Write_All(uint16_t channel1OutPutMode, uint16_t channel2OutPutMode, 
     uint16_t channel3OutPutMode, uint16_t channel4OutPutMode, uint16_t channel5OutPutMode, 
     uint16_t channel6OutPutMode, uint16_t channel7OutPutMode)
{
     uint16_t regValue = 0;
     channel1OutPutMode &= RL78G13_TIMER_TOM_CHANNEL_1_OUTPUT_MODE_MASK;
     channel2OutPutMode &= RL78G13_TIMER_TOM_CHANNEL_2_OUTPUT_MODE_MASK;
     channel3OutPutMode &= RL78G13_TIMER_TOM_CHANNEL_3_OUTPUT_MODE_MASK;
     channel4OutPutMode &= RL78G13_TIMER_TOM_CHANNEL_4_OUTPUT_MODE_MASK;
     channel5OutPutMode &= RL78G13_TIMER_TOM_CHANNEL_5_OUTPUT_MODE_MASK;
     channel6OutPutMode &= RL78G13_TIMER_TOM_CHANNEL_6_OUTPUT_MODE_MASK;
     channel7OutPutMode &= RL78G13_TIMER_TOM_CHANNEL_7_OUTPUT_MODE_MASK;
     regValue = (channel1OutPutMode| channel2OutPutMode| channel3OutPutMode|
         channel4OutPutMode| channel5OutPutMode| channel6OutPutMode|
         channel7OutPutMode);
     RL78G13_Timer_TOM_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_TOM_Write_One(uint16_t mask, uint16_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer tom write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_TOM_Write_One(uint16_t mask, uint16_t value)
{
    uint16_t regValue = RL78G13_Timer_TOM_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_TOM_Write(regValue);
}

/**
 * Function:        uint16_t RL78G13_Timer_TOM_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer tom read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint16_t.
 */

