dinkdeng/RL78_Board_IAR/IAR/Common/src/RL78G13_Timer.c
uint16_t RL78G13_Timer_TOM_ReadAll(void)
{
    return RL78G13_Timer_TOM_Read();
}

/**
 * Function:        uint16_t RL78G13_Timer_TOM_ReadOne(uint16_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer tom read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint16_t.
 */

uint16_t RL78G13_Timer_TOM_ReadOne(uint16_t mask)
{
    uint16_t regValue = RL78G13_Timer_TOM_Read();
    regValue &= mask;
    return regValue;
}

/*NFEN1*/

/**
 * Function:    
 *  void RL78G13_Timer_NFEN1_Write_All(uint8_t channel0NoiseFilterEnable,
 *  uint8_t channel1NoiseFilterEnable, uint8_t channel2NoiseFilterEnable,
 *  uint8_t channel3NoiseFilterEnable, uint8_t channel4NoiseFilterEnable,
 *  uint8_t channel5NoiseFilterEnable, uint8_t channel6NoiseFilterEnable,
 *  uint8_t channel7NoiseFilterEnable)
 *
 * Brief:
 *      Rl 78 g 13 timer nfen 1 write all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  channel0NoiseFilterEnable -     The channel 0 noise filter enable.
 *  channel1NoiseFilterEnable -     The channel 1 noise filter enable.
 *  channel2NoiseFilterEnable -     The channel 2 noise filter enable.
 *  channel3NoiseFilterEnable -     The channel 3 noise filter enable.
 *  channel4NoiseFilterEnable -     The channel 4 noise filter enable.
 *  channel5NoiseFilterEnable -     The channel 5 noise filter enable.
 *  channel6NoiseFilterEnable -     The channel 6 noise filter enable.
 *  channel7NoiseFilterEnable -     The channel 7 noise filter enable.
 */

void RL78G13_Timer_NFEN1_Write_All(uint8_t channel0NoiseFilterEnable,
     uint8_t channel1NoiseFilterEnable, uint8_t channel2NoiseFilterEnable, 
     uint8_t channel3NoiseFilterEnable, uint8_t channel4NoiseFilterEnable, 
     uint8_t channel5NoiseFilterEnable, uint8_t channel6NoiseFilterEnable, 
     uint8_t channel7NoiseFilterEnable)
{
     uint8_t regValue = 0;
     channel0NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_0_NOISE_FILTER_MODE_MASK;
     channel1NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_1_NOISE_FILTER_MODE_MASK;
     channel2NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_2_NOISE_FILTER_MODE_MASK;
     channel3NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_3_NOISE_FILTER_MODE_MASK;
     channel4NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_4_NOISE_FILTER_MODE_MASK;
     channel5NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_5_NOISE_FILTER_MODE_MASK;
     channel6NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_6_NOISE_FILTER_MODE_MASK;
     channel7NoiseFilterEnable &= RL78G13_TIMER_NFEN2_CHANNEL_7_NOISE_FILTER_MODE_MASK;
     regValue = (channel0NoiseFilterEnable| channel1NoiseFilterEnable| channel2NoiseFilterEnable|
         channel3NoiseFilterEnable| channel4NoiseFilterEnable| channel5NoiseFilterEnable|
         channel6NoiseFilterEnable| channel7NoiseFilterEnable);
     RL78G13_Timer_NFEN1_Write(regValue);
}

/**
 * Function:        void RL78G13_Timer_NFEN1_Write_One(uint8_t mask, uint8_t value)
 *
 * Brief:
 *      Rl 78 g 13 timer nfen 1 write one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -      The mask.
 *  value -     The value.
 */

void RL78G13_Timer_NFEN1_Write_One(uint8_t mask, uint8_t value)
{
    uint8_t regValue = RL78G13_Timer_NFEN1_Read();
    value &= mask;
    regValue &= (~mask);
    regValue |= value;
    RL78G13_Timer_NFEN1_Write(regValue);
}

/**
 * Function:        uint8_t RL78G13_Timer_NFEN1_ReadAll(void)
 *
 * Brief:
 *      Rl 78 g 13 timer nfen 1 read all.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Returns:
 *      An uint8_t.
 */

uint8_t RL78G13_Timer_NFEN1_ReadAll(void)
{
    return RL78G13_Timer_NFEN1_Read();
}

/**
 * Function:        uint8_t RL78G13_Timer_NFEN1_ReadOne(uint8_t mask)
 *
 * Brief:
 *      Rl 78 g 13 timer nfen 1 read one.
 *
 * Author:
 *      Dink
 *
 * Date:
 *      2017/10/30
 *
 * Param:
 *  mask -  The mask.
 *
 * Returns:
 *      An uint8_t.
 */

uint8_t RL78G13_Timer_NFEN1_ReadOne(uint8_t mask)
{
    uint8_t regValue = RL78G13_Timer_NFEN1_Read();
    regValue &= mask;
    return regValue;
}